In [1]:
import pandas as pd
pd.options.display.max_rows = 100
orderlines = pd.read_csv('orderlines.csv')

In [2]:
#Removed first dot in 36169 rows with prices with two dots
#Removed two price outliers NEA0009 and APP1465
#Should we delete the SKUs we have deleted in the table products because of weired prices?
#Check for number of orders

In [3]:
orderlines

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38
...,...,...,...,...,...,...,...
293978,1650199,527398,0,1,JBL0122,42.99,2018-03-14 13:57:25
293979,1650200,527399,0,1,PAC0653,141.58,2018-03-14 13:57:34
293980,1650201,527400,0,2,APP0698,9.99,2018-03-14 13:57:41
293981,1650202,527388,0,1,BEZ0204,19.99,2018-03-14 13:58:01
293982,1650203,527401,0,1,APP0927,13.99,2018-03-14 13:58:36

In [4]:
orderlines_df = orderlines.copy()

In [5]:
#change object date into date format
orderlines_df["date"] = pd.to_datetime(orderlines_df["date"])

In [6]:
#How many rows have 3 numbers after the decimal point?
orderlines_df.loc[orderlines_df.unit_price.str.contains("\d+\.\d+\.\d{3,}")]

Empty DataFrame
Columns: [id, id_order, product_id, product_quantity, sku, unit_price, date]
Index: []

In [7]:
#Counts how many prices contain one dot
orderlines_df.unit_price.str.contains("\d+\.\d+").value_counts()

unit_price
True    293983
Name: count, dtype: int64

In [8]:
#Counts how many prices contain two dots
orderlines_df.unit_price.str.contains("\d+\.\d+\.\d+").value_counts()

unit_price
False    257814
True      36169
Name: count, dtype: int64

In [9]:
#Counts how many prices contain two dots
orderlines_df.loc[orderlines_df.unit_price.str.contains("\d+\.\d+\.\d+")]

,id,id_order,product_id,product_quantity,sku,unit_price,date
6,1119115,299544,0,1,APP1582,1.137.99,2017-01-01 01:17:21
11,1119126,299549,0,1,PAC0929,2.565.99,2017-01-01 02:07:42
15,1119131,299553,0,1,APP1854,3.278.99,2017-01-01 02:14:47
43,1119195,299582,0,1,PAC0961,2.616.99,2017-01-01 08:54:00
59,1119214,299596,0,1,PAC1599,2.873.99,2017-01-01 09:53:11
...,...,...,...,...,...,...,...
293862,1649999,452946,0,1,APP2075,2.999.00,2018-03-14 13:03:33
293887,1650045,527321,0,1,PAC2148,3.497.00,2018-03-14 13:10:15
293889,1650050,527324,0,1,PAC2117,3.075.00,2018-03-14 13:10:56
293911,1650088,527342,0,1,APP2492,1.329.00,2018-03-14 13:24:51
293936,1650135,527364,0,1,APP2491,1.329.00,2018-03-14 13:36:13

In [10]:
two_dot_percentage = ((orderlines_df.unit_price.str.contains("\d+\.\d+\.\d+").value_counts()[1] / orderlines_df.shape[0])*100).round(2)
print(f"The 2 dot problem represents {two_dot_percentage}% of the rows in our DataFrame")

The 2 dot problem represents 12.3% of the rows in our DataFrame

In [11]:
# Create a mask for rows with prices containing two dots
mask = orderlines_df['unit_price'].str.contains(r"\d+\.\d+\.\d+")

# Apply the replace only on those rows
orderlines_df.loc[mask, 'unit_price'] = orderlines_df.loc[mask, 'unit_price'].str.replace('.', '', 1)

In [12]:
#Counts how many prices contain two dots
orderlines_df.unit_price.str.contains("\d+\.\d+\.\d+").value_counts()

unit_price
False    293983
Name: count, dtype: int64

In [13]:
#Counts how many prices contain one dot
orderlines_df.unit_price.str.contains("\d+\.\d+").value_counts()

unit_price
True    293983
Name: count, dtype: int64

In [14]:
#How many rows have 3 numbers after the decimal point?
orderlines_df.unit_price.str.contains("\d+\.\d{3,}").value_counts()

unit_price
False    293983
Name: count, dtype: int64

In [15]:
orderlines_df["unit_price"] = pd.to_numeric(orderlines_df["unit_price"])

In [16]:
orderlines_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293983 entries, 0 to 293982
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   id                293983 non-null  int64
 1   id_order          293983 non-null  int64
 2   product_id        293983 non-null  int64
 3   product_quantity  293983 non-null  int64
 4   sku               293983 non-null  object
 5   unit_price        293983 non-null  float64
 6   date              293983 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(4), object(1)
memory usage: 15.7+ MB

In [17]:
orderlines_df.loc[orderlines_df['unit_price'] == 0]

,id,id_order,product_id,product_quantity,sku,unit_price,date
53515,1227566,345934,0,1,KIN0153-2,0.0,2017-04-13 13:47:21
53530,1227590,345957,0,1,WDT0347,0.0,2017-04-13 14:44:05
56529,1232832,348502,0,1,LIBRO,0.0,2017-04-21 18:14:54
56562,1232888,348531,0,1,LIBRO,0.0,2017-04-21 19:46:54
56576,1232909,348542,0,1,LIBRO,0.0,2017-04-21 20:48:06
...,...,...,...,...,...,...,...
291880,1646431,525595,0,1,SYN0150,0.0,2018-03-11 20:50:46
292216,1647014,525883,0,1,APP0699,0.0,2018-03-12 12:26:57
292388,1647334,526025,0,1,WAC0251,0.0,2018-03-12 16:31:39
292905,1648288,526430,0,1,OWC0110,0.0,2018-03-13 13:27:05
292906,1648289,526430,0,1,NTE0013,0.0,2018-03-13 13:27:05

In [18]:
orderlines_df.loc[orderlines_df['unit_price'] < 0]

,id,id_order,product_id,product_quantity,sku,unit_price,date
77008,1268645,365886,0,1,APP1465,-119.0,2017-06-15 12:48:54

In [19]:
orderlines_df['id_order'].nunique()

204855

In [20]:
orderlines_df['id_order'].count()

293983

In [21]:
orderlines_df['sku'].nunique()

7951

In [22]:
orderlines_df.sort_values(by='unit_price', ascending=False)

,id,id_order,product_id,product_quantity,sku,unit_price,date
36979,1197439,331780,0,1,NEA0009,159989.83,2017-03-03 22:29:21
38317,1200059,332976,0,6,LAC0223,15349.00,2017-03-07 15:51:14
282442,1632863,520029,0,1,APP2660,14725.00,2018-03-02 11:57:52
253465,1585660,500546,0,1,APP2660,14580.00,2018-01-29 01:55:02
232052,1551007,487164,0,1,APP2660,14580.00,2018-01-09 23:33:16
...,...,...,...,...,...,...,...
69092,1254720,359037,0,1,LIBRO,0.00,2017-05-25 12:27:59
69146,1254827,359083,0,3,LIBRO,0.00,2017-05-25 13:59:29
246444,1575082,496513,0,1,ALL0008,0.00,2018-01-23 03:40:54
160051,1433959,437637,0,1,BOS0065,0.00,2017-11-24 09:22:36
77008,1268645,365886,0,1,APP1465,-119.00,2017-06-15 12:48:54

In [23]:
#Remove outlier with price of 150.000
orderlines[orderlines_df['sku'] == 'NEA0009']
#orderlines_df = orderlines_df[orderlines_df['sku'] != 'NEA0009']

In [24]:
#Remove outlier with price of -119 Euro
orderlines_df = orderlines_df[orderlines_df['sku'] != 'APP1465']

In [25]:
orderlines_df.sort_values(by='unit_price', ascending=False)

,id,id_order,product_id,product_quantity,sku,unit_price,date
38317,1200059,332976,0,6,LAC0223,15349.0,2017-03-07 15:51:14
282442,1632863,520029,0,1,APP2660,14725.0,2018-03-02 11:57:52
248338,1577659,497375,0,1,APP2660,14580.0,2018-01-23 23:55:41
232052,1551007,487164,0,1,APP2660,14580.0,2018-01-09 23:33:16
234834,1555558,488935,0,4,APP2660,14580.0,2018-01-11 21:11:34
...,...,...,...,...,...,...,...
271941,1614765,511949,0,1,OWC0144,0.0,2018-02-15 11:29:29
160562,1434846,438068,0,1,SYN0188,0.0,2017-11-24 10:32:27
264880,1603812,507367,0,1,APP2499,0.0,2018-02-07 12:23:07
162017,1437538,439263,0,1,SNS0025,0.0,2017-11-24 13:58:26
244679,1571802,495132,0,1,SNN0063,0.0,2018-01-20 17:09:36

In [26]:
#Categorizing in price groups
bins = [0, 50, 100, 200, 500, 750, 1000, 2500, 5000, 7500, 10000, 12500, 16000]  
labels = ['-50', '-100', '-200', '-500', '-750', '-1000', '-2500', '-5000', '-7500', '-10000', '-12500', '-16000'] 

orderlines_df['price_group'] = pd.cut(orderlines_df['unit_price'], bins=bins, labels=labels, right=False)

In [27]:
orderlines_df.groupby('price_group')['sku'].count()

price_group
-50       93882
-100      59356
-200      47556
-500      35516
-750       9865
-1000     10993
-2500     24009
-5000     11689
-7500       405
-10000       33
-12500       17
-16000       15
Name: sku, dtype: int64

In [28]:
orderlines_df['unit_price'].max()

15349.0

In [29]:
#Calculating average price: Revenue/number of products sold - or-
#Sum of Unit_Prices/Sum of SKUs

In [30]:
round(orderlines_df['unit_price'].sum())

120244927

In [31]:
orderlines_df['id_order'].count()

293336

In [32]:
orderlines_df['id_order'].nunique()

204407

In [33]:
orderlines_df['sku'].nunique()

7949

In [34]:
orderlines_df['sku'].count()

293336

In [35]:
# 120.244.927 / 293.336 = 410 Euro

In [36]:
orderlines_cl1 = orderlines_df

In [37]:
orderlines_cl1 = pd.read_csv('orderlines_cl1.csv', parse_dates=['date'])